In [3]:
import pandas as pd

 ### Creating panda's Series from Python list

In [98]:
contries=['IND','CHN','USA','RUS']
index=[0,1,2,3]

In [112]:
my_series1=pd.Series(countries,index)

In [113]:
print(my_series1)

0        India
1          USA
2       CANADA
3    Australia
dtype: object

In [104]:
type(my_series)

pandas.core.series.Series

- Here Index axis is optional

### Creating panda's Series from Python Dictionary

In [15]:
my_dictionary={'name':'Manoj','gender':'male','ocupation':'Engineer'}

In [115]:
my_series2=pd.Series(my_dictionary)
print(my_series2)

gender           male
name            Manoj
ocupation    Engineer
dtype: object

### Grabbing information from Series

In [ ]:
my_series1[0]

In [117]:
my_series2['name']

'Manoj'

In [22]:
my_series[1]

'Manoj'

In [119]:
my_series3=pd.Series([1,2,3,4],['Manoj','Male','Engineer','MZn'])

In [120]:
my_series3['Manoj']

1

### Performing Arithmetic operations on Series

In [39]:
Series1=pd.Series([1,2,3,4],['Manoj','Male','Engineer','MZn'])

In [46]:
Series2=pd.Series([1,2,3,4],['Kumar','Male','Engineer','Delhi'])

In [42]:
Series1-Series2 #NaN -Not a number

Delhi       NaN
Engineer    0.0
Kumar       NaN
MZn         NaN
Male        0.0
Manoj       NaN
dtype: float64

In [47]:
Series1+Series2

Delhi       NaN
Engineer    6.0
Kumar       NaN
MZn         NaN
Male        4.0
Manoj       NaN
dtype: float64

In [49]:
Series1*Series2

Delhi       NaN
Engineer    9.0
Kumar       NaN
MZn         NaN
Male        4.0
Manoj       NaN
dtype: float64

In [50]:
Series1/Series2

Delhi       NaN
Engineer    1.0
Kumar       NaN
MZn         NaN
Male        1.0
Manoj       NaN
dtype: float64

### DataFrames

In [ ]:
# Basic Syntax to creating Data frame:
pd.DataFrame(data,index)

In [55]:
# Data Frame of Random Number having 5 Rows and 4 column:
import numpy as np
df=pd.DataFrame(np.random.random((5,4)),['A','B','C','D','E'],['W','X','Y','Z'])

In [56]:
df

          W         X         Y         Z
A  0.882869  0.582638  0.659056  0.146293
B  0.065064  0.751091  0.433941  0.701442
C  0.429696  0.957589  0.281260  0.258662
D  0.529435  0.386094  0.246257  0.862162
E  0.377510  0.331391  0.323286  0.168526

#here each column is a panda series which is sharing a same index means DF is a collection of Series sharing the same Index.

#### Creating DataFrame from a dictionary Of Series.

In [140]:
my_dict={'Name':pd.Series(['AA','BB','CC','DD'],index=[0,1,2,3]),
         'Age': pd.Series([15,20,25,30],index=[0,1,2,3]),
        'Gender':pd.Series(['M','F','F','M'],index=[0,1,2,3])}

In [141]:
pd.DataFrame(my_dict)

   Age Gender Name
0   15      M   AA
1   20      F   BB
2   25      F   CC
3   30      M   DD

#### Creating DataFrame from a dictionary Of list.

In [143]:
my_dict1={'Name':['Manoj','SAN','JAM','OPO'],
    'Age':[20,25,30,35],
    'Year':[2012,2013,2014,2015] 
   }

In [148]:
my_df1=pd.DataFrame(my_dict1,index=[0,1,2,3])

In [153]:
my_df1

   Age   Name  Year
0   20  Manoj  2012
1   25    SAN  2013
2   30    JAM  2014
3   35    OPO  2015

In [167]:
my_df1= pd.DataFrame(my_dict1,index=[0,1,2,3])
my_df1

   Age   Name  Year
0   20  Manoj  2012
1   25    SAN  2013
2   30    JAM  2014
3   35    OPO  2015

### Selecting Columns from DataFrames

In [168]:
my_df1['Age'] # As We choose a column having same index so output is a series

0    20
1    25
2    30
3    35
Name: Age, dtype: int64

In [169]:
type(my_df1['Age'])

pandas.core.series.Series

### If we grab multiple columns, the result will be a DataFrame:

In [170]:
    my_df1[['Name','Year']]

    Name  Year
0  Manoj  2012
1    SAN  2013
2    JAM  2014
3    OPO  2015

In [172]:
my_df1['Grd_Year']=pd.Series([2020.2021,2023,2024],[0,1,2,3])

ValueError: Wrong number of items passed 3, placement implies 4

In [91]:
my_df1['Grad_year']=

In [173]:
pd.DataFrame(my_dict1)

   Age   Name  Year
0   20  Manoj  2012
1   25    SAN  2013
2   30    JAM  2014
3   35    OPO  2015

In [174]:
my_dict1['Nationality']=pd.Series(['IND','USA','CHN','JPN'],index=[0,1,2,3])

In [190]:
my_df2=pd.DataFrame(my_dict1)
#print(my_df2)
my_df2

   Age   Name Nationality  Year
0   20  Manoj         IND  2012
1   25    SAN         USA  2013
2   30    JAM         CHN  2014
3   35    OPO         JPN  2015

#### Removing rows/columns from a DataFrame

In [194]:
my_df2.drop('Year',axis=1)

   Age   Name Nationality
0   20  Manoj         IND
1   25    SAN         USA
2   30    JAM         CHN
3   35    OPO         JPN

In [ ]:
# To delete the ith Index row

In [195]:
my_df2.drop(2,axis=0)

   Age   Name Nationality  Year
0   20  Manoj         IND  2012
1   25    SAN         USA  2013
3   35    OPO         JPN  2015

In [197]:
my_df2

   Age   Name Nationality  Year
0   20  Manoj         IND  2012
1   25    SAN         USA  2013
2   30    JAM         CHN  2014
3   35    OPO         JPN  2015

In [199]:
my_df2.iloc[0]

Age               20
Name           Manoj
Nationality      IND
Year            2012
Name: 0, dtype: object

In [ ]:
# Continue from Conditional selection